OfficeActivity
| where OfficeWorkload == "Exchange"
| where Operation == "Remove-SafeLinksPolicy"
| extend RemovedPolicy = OfficeObjectId
| extend Actor = UserId
| extend Settings = todynamic(Parameters)
| project TimeGenerated, Actor, RemovedPolicy, Settings
