AuditLogs
| where SourceSystem == "Azure AD"
| where OperationName == "Update conditional access policy"
| where Result  == "success"
| extend ChangedCaPolicy = tostring(TargetResources[0].displayName)
| extend Actor = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| extend NewConditions = todynamic(tostring(parse_json(tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[0].newValue)).conditions))))
| extend OldConditions = todynamic(tostring(parse_json(tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[0].oldValue)).conditions))))
| extend ChangedUser = iff(tostring(OldConditions.users) != tostring(NewConditions.users), "Users have been changed","No users changed")
| order by TimeGenerated
