OfficeActivity
| where OfficeWorkload == "Exchange"
| where Operation == "Set-SafeAttachmentPolicy"
| extend ChangedPolicy = OfficeObjectId
| extend Actor = UserId
| extend Settings = todynamic(Parameters)
| project TimeGenerated, Actor, ChangedPolicy, Settings
