OfficeActivity
| where OfficeWorkload == "Exchange"
| where Operation == "Set-HostedContentFilterRule"
| extend ChangedPolicy = split(OfficeObjectId, "\\",1)
| extend Actor = UserId
| extend Settings = todynamic(Parameters)
| project TimeGenerated, Actor, ChangedPolicy, Settings
