OfficeActivity
| where OfficeWorkload == "Exchange"
| where Operation contains "remove-HostedContentFilterRule"
| extend RemovedPolicy = OfficeObjectId
| extend Actor = UserId
| extend Settings = todynamic(Parameters)
| project TimeGenerated, Actor, RemovedPolicy, Settings
