AuditLogs
| where SourceSystem == "Azure AD"
| where OperationName == "Delete conditional access policy"
| where Result == "success"
| extend Actor = InitiatedBy.user.userPrincipalName
| extend DeletedCAPolicy = TargetResources[0].displayName
| extend CAPolicySettings = TargetResources[0].modifiedProperties[0].oldValue
| project TimeGenerated, Actor, DeletedCAPolicy, CAPolicySettings
