AuditLogs
| where OperationName == "Update authorization policy"
| where SourceSystem  == "Azure AD"
| extend Actor = InitiatedBy.user.userPrincipalName
| extend UserConsentSetting = TargetResources[0].modifiedProperties[0].newValue[0] 
| extend EnterpriseConsentSetting = iff( TargetResources[0].modifiedProperties[0].newValue[0] == "","Admin consent is activated","Admin consent is not active!")
| project TimeGenerated, Actor,  EnterpriseConsentSetting
